# # quiz(re) - 회원가입 시스템 만들기

# userData = {}

# flag = True

# while flag:
#     selectedMenuNum = int(input('1.회원가입     2.프로그램 종료'))

#     if selectedMenuNum == 1:
#         id = input('아이디 입력: ')
#         pw = input('비밀번호 입력: ')
#         userData[id] = pw

#     elif selectedMenuNum == 2:
#         flag = False

# for key in userData.keys():
#     print(f'아이디: {key} // 비밀번호: {userData[key]}')
# # 1.회원가입     2.프로그램 종료1
# # 아이디 입력: 1111
# # 비밀번호 입력: 2222
# # 1.회원가입     2.프로그램 종료1
# # 아이디 입력: 3333
# # 비밀번호 입력: 4444
# # 1.회원가입     2.프로그램 종료1
# # 아이디 입력: 5555
# # 비밀번호 입력: 6666
# # 1.회원가입     2.프로그램 종료1
# # 아이디 입력: 7777
# # 비밀번호 입력: 8888
# # 1.회원가입     2.프로그램 종료1
# # 아이디 입력: 9999
# # 비밀번호 입력: 0000
# # 1.회원가입     2.프로그램 종료2
# # 아이디: 1111 // 비밀번호: 2222
# # 아이디: 3333 // 비밀번호: 4444
# # 아이디: 5555 // 비밀번호: 6666
# # 아이디: 7777 // 비밀번호: 8888
# # 아이디: 9999 // 비밀번호: 0000
